lib/tasks/import_data.rake

INSERT INTO "bank_budgets" ("work_program_group", "work_program", "unit", "fiscal_year", "bank_budget", "all_funds", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."work_program_group" = $1 AND "bank_budgets"."work_program" = $2 AND "bank_budgets"."unit" = $3 AND "bank_budgets"."fiscal_year" = $4 AND "bank_budgets"."bank_budget" IS NULL AND "bank_budgets"."all_funds" IS NULL AND "bank_budgets"."notes" = $5 LIMIT $6
---
  task data: :environment do
    file_path = File.join(Rails.root, 'public','world_program.csv')
    csv_text = File.read(file_path)
    csv = CSV.parse(csv_text, :headers => true)
    csv.each_with_index do |row, i|
      ActiveRecord::Base.transaction do
        row_hash = row.to_hash
        BankBudget.find_or_create_by(
          work_program_group: row["Work Program Group"],
          work_program: row["Work Program"],
          unit: row["Unit"],
          fiscal_year: row["Fiscal Year"],
          bank_budget: row["Bank Budget (BB) (US$, Millions)"],
          all_funds: row["All Funds (US$, Millions)"],
          notes: row["Notes"]
        )