app/views/bank_budgets/trend.html.erb

SELECT "bank_budgets"."fiscal_year" FROM "bank_budgets"
---
  <div class="panel-body">
    <% BankBudget.pluck(:fiscal_year).uniq.sort.each do |b| %>