app/controllers/bank_budgets_controller.rb

SELECT  "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_bank_budget
      @bank_budget = BankBudget.find(params[:id])