app/controllers/bank_budgets_controller.rb

  def index
    @q = BankBudget.ransack(params[:q])
    @bank_budgets = @q.result.order(:fiscal_year).page(params[:page]).per(10)
---
SELECT  "bank_budgets".* FROM "bank_budgets" ORDER BY "bank_budgets"."fiscal_year" DESC, "bank_budgets"."fiscal_year" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 20]]
SELECT COUNT(*) FROM "bank_budgets"

  def work_program_group
    @bank_budgets = BankBudget.pluck(:work_program_group).uniq
---
SELECT "bank_budgets"."work_program_group" FROM "bank_budgets"

  def work_show
    @bank_budgets = BankBudget.where(work_program_group: params[:work_program_group])
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."work_program_group" = $1  [["work_program_group", "Centrally Managed Accounts & Miscellaneous Programs"]]

    @budget2021 = []
    @funds2021 = []

    BankBudget.where(fiscal_year: "2015").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2015]]

      }
    ].to_json

    BankBudget.where(fiscal_year: "2016").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2016]]

      }
    ].to_json

    BankBudget.where(fiscal_year: "2017").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2017]]

      }
    ].to_json

    BankBudget.where(fiscal_year: "2018").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2018]]

      }
    ].to_json

    BankBudget.where(fiscal_year: "2019").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2019]]

      }
    ].to_json

    BankBudget.where(fiscal_year: "2020").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2020]]

      }
    ].to_json

    BankBudget.where(fiscal_year: "2021").each do |bank_budget|
---
SELECT "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."fiscal_year" = $1  [["fiscal_year", 2021]]

    def set_bank_budget
      @bank_budget = BankBudget.find(params[:id])
---
SELECT  "bank_budgets".* FROM "bank_budgets" WHERE "bank_budgets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]